<a href="https://colab.research.google.com/github/rutvik1990/Data_Analysis_Notebooks/blob/main/Pandas%20Notes/Pandas_Introduction.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Introduction To Pandas
The word pandas is an acronym which is derived from "Python and data analysis" and "panel data".
There is often some confusion about whether Pandas is an alternative to Numpy, SciPy and Matplotlib. The truth is that it is built on top of Numpy. This means that Numpy is required by pandas. Scipy and Matplotlib on the other hand are not required by pandas but they are extremely useful.

# Data Structures
We will start with the following two important data structures of Pandas:

Series and
DataFrame

Pandas is a software library written for the Python programming language. It is used for data manipulation and analysis. It provides special data structures and operations for the manipulation of numerical tables and time series.

# Series
A Series is a one-dimensional labelled array-like object. It is capable of holding any data type, e.g. integers, floats, strings, Python objects, and so on. It can be seen as a data structure with two arrays: one functioning as the index, i.e. the labels, and the other one contains the actual data.

We define a simple Series object in the following example by instantiating a Pandas Series object with a list.

In [ ]:
import pandas as pd
S = pd.Series([11, 28, 72, 3, 5, 8])
S[0]

11

In [ ]:
#we can access the seriese like this also
print(S.index)
print(S.values)

RangeIndex(start=0, stop=6, step=1)
[11 28 72  3  5  8]

In [ ]:
#we can create a serise with specific index value also
fruits = ['apples', 'oranges', 'cherries', 'pears']
quantities = [20, 33, 52, 10]
S = pd.Series(quantities, index=fruits)
S['apples']

20

In [ ]:
#If we addd to serise we can get a new serise with the same index  
fruits = ['apples', 'oranges', 'cherries', 'pears']
S = pd.Series([20, 33, 52, 10], index=fruits)
S2 = pd.Series([17, 13, 31, 32], index=fruits)
print(S + S2)
print("sum of S: ", sum(S))

apples      37
oranges     46
cherries    83
pears       42
dtype: int64
sum of S:  115

In [ ]:
#if both series have different index then 
fruits = ['peaches', 'oranges', 'cherries', 'pears']
fruits2 = ['raspberries', 'oranges', 'cherries', 'pears']
S = pd.Series([20, 33, 52, 10], index=fruits)
S2 = pd.Series([17, 13, 31, 32], index=fruits2)
print(S + S2)

cherries       83.0
oranges        46.0
peaches         NaN
pears          42.0
raspberries     NaN
dtype: float64

In [ ]:
fruits = ['apples', 'oranges', 'cherries', 'pears']
fruits_ro = ["mere", "portocale", "cireșe", "pere"]
S = pd.Series([20, 33, 52, 10], index=fruits)
S2 = pd.Series([17, 13, 31, 32], index=fruits_ro)
print(S+S2)

apples      NaN
cherries    NaN
cireșe      NaN
mere        NaN
oranges     NaN
pears       NaN
pere        NaN
portocale   NaN
dtype: float64

In [ ]:
# we can print more or one values by index
print(S['apples'])
print(S[['apples', 'oranges', 'cherries']])

20
apples      20
oranges     33
cherries    52
dtype: int64

In [ ]:
import numpy as np
print((S + 3) * 4)
print("======================")
print(np.sin(S))
print(np.sin(20))

apples       92
oranges     144
cherries    220
pears        52
dtype: int64
======================
apples      0.912945
oranges     0.999912
cherries    0.986628
pears      -0.544021
dtype: float64
0.9129452507276277

# pandas.Series.apply
Series.apply(func, convert_dtype=True, args=(), **kwds)

The function "func" will be applied to the Series and it returns either a Series or a DataFrame, depending on "func".

Parameter	Meaning
func	a function, which can be a NumPy function that will be applied to the entire Series or a Python function that will be applied to every single value of the series
convert_dtype	A boolean value. If it is set to True (default), apply will try to find better dtype for elementwise function results. If False, leave as dtype=object
args	Positional arguments which will be passed to the function "func" additionally to the values from the series.
**kwds	Additional keyword arguments will be passed as keywords to the function
Example:

In [ ]:
def apply_a(S):
    S = S-10
    return S
S.apply(apply_a)

apples      10
oranges     23
cherries    42
pears        0
dtype: int64

In [ ]:
# We can pass a dict to serise
cities = {"London":   8615246, 
          "Berlin":   3562166, 
          "Madrid":   3165235, 
          "Rome":     2874038, 
          "Paris":    2273305, 
          "Vienna":   1805681, 
          "Bucharest":1803425, 
          "Hamburg":  1760433,
          "Budapest": 1754000,
          "Warsaw":   1740119,
          "Barcelona":1602386,
          "Munich":   1493900,
          "Milan":    1350680}
city_series = pd.Series(cities)
print(city_series)

[8615246 3562166 3165235 2874038 2273305 1805681 1803425 1760433 1754000
 1740119 1602386 1493900 1350680]

In [ ]:
# Handling Missing Values- Nan values
my_cities = ["London", "Paris", "Zurich", "Berlin", 
             "Stuttgart", "Hamburg"]
my_city_series = pd.Series(cities, 
                           index=my_cities)
my_city_series
# here values are converted into floats due to missing values

London       8615246.0
Paris        2273305.0
Zurich             NaN
Berlin       3562166.0
Stuttgart          NaN
Hamburg      1760433.0
dtype: float64

In [ ]:
# if we do not have missing valures ans is in int
my_cities = ["London", "Paris", "Berlin", "Hamburg"]
my_city_series = pd.Series(cities, 
                           index=my_cities)
my_city_series

London     8615246
Paris      2273305
Berlin     3562166
Hamburg    1760433
dtype: int64

In [ ]:
#Methods isnull() and notnull()

my_cities = ["London", "Paris", "Zurich", "Berlin", 
             "Stuttgart", "Hamburg"]
my_city_series = pd.Series(cities, 
                           index=my_cities)
print(my_city_series.isnull())#isnull()

print(my_city_series.notnull())#notnull()

London       False
Paris        False
Zurich        True
Berlin       False
Stuttgart     True
Hamburg      False
dtype: bool
London        True
Paris         True
Zurich       False
Berlin        True
Stuttgart    False
Hamburg       True
dtype: bool

In [ ]:
#if dict have value none for some key it becomes Nan
import pandas as pd


d = {"a":23, "b":45, "c":None, "d":0}
S = pd.Series(d)
print(S)
pd.isnull(S)

a    23.0
b    45.0
c     NaN
d     0.0
dtype: float64

a    False
b    False
c     True
d    False
dtype: bool

In [ ]:
# Filtering out missing values with the Series method dropna it excludes missing value fields

print(my_city_series.dropna())

London     8615246.0
Paris      2273305.0
Berlin     3562166.0
Hamburg    1760433.0
dtype: float64

# Filling in Missing Data
In many cases you don't want to filter out missing data, but you want to fill in appropriate data for the empty gaps. A suitable method in many situations will be fillna:

In [ ]:

print(my_city_series.fillna(12))

London       8615246.0
Paris        2273305.0
Zurich            12.0
Berlin       3562166.0
Stuttgart         12.0
Hamburg      1760433.0
dtype: float64

# DataFrame
The underlying idea of a DataFrame is based on spreadsheets. We can see the data structure of a DataFrame as tabular and spreadsheet-like. A DataFrame logically corresponds to a "sheet" of an Excel document. A DataFrame has both a row and a column index.
There is a close connection between the DataFrames and the Series of Pandas. A DataFrame can be seen as a concatenation of Series, each Series having the same index, i.e. the index of the DataFrame.

In [ ]:
import pandas as pd
years = range(2014, 2018)
shop1 = pd.Series([2409.14, 2941.01, 3496.83, 3119.55], index=years)
shop2 = pd.Series([1203.45, 3441.62, 3007.83, 3619.53], index=years)
shop3 = pd.Series([3412.12, 3491.16, 3457.19, 1963.10], index=years)
pd.concat([shop1, shop2, shop3])

2014    2409.14
2015    2941.01
2016    3496.83
2017    3119.55
2014    1203.45
2015    3441.62
2016    3007.83
2017    3619.53
2014    3412.12
2015    3491.16
2016    3457.19
2017    1963.10
dtype: float64

# DataFrames from Dictionaries
A DataFrame has a row and column index; it's like a dict of Series with a common index.

In [ ]:
cities = {"name": ["London", "Berlin", "Madrid", "Rome", 
                   "Paris"],
          "population": [8615246, 3562166, 3165235, 2874038,
                         2273305],
          "country": ["England", "Germany", "Spain", "Italy",
                      "France"]}
city_frame = pd.DataFrame(cities)
print(city_frame)

     name  population  country
0  London     8615246  England
1  Berlin     3562166  Germany
2  Madrid     3165235    Spain
3    Rome     2874038    Italy
4   Paris     2273305   France

In [ ]:
#Retrieving the Column Names

city_frame.columns.values

array(['țară', 'populație', 'cum_population'], dtype=object)

# Custom Index
We can see that an index (0,1,2, ...) has been automatically assigned to the DataFrame. We can also assign a custom index to the DataFrame object:

In [ ]:
ordinals = ["first", "second", "third", "fourth",
            "fifth"]
city_frame = pd.DataFrame(cities, index=ordinals)
city_frame

          name  population  country
first   London     8615246  England
second  Berlin     3562166  Germany
third   Madrid     3165235    Spain
fourth    Rome     2874038    Italy
fifth    Paris     2273305   France

# Rearranging the Order of Columns
We can also define and rearrange the order of the columns at the time of creation of the DataFrame. This makes also sure that we will have a defined ordering of our columns, if we create the DataFrame from a dictionary. Dictionaries are not ordered so we cannot know in advance what the ordering of our columns will be:

In [ ]:
city_frame = pd.DataFrame(cities,
                          columns=["name", 
                                   "country", 
                                   "population"])
city_frame

     name  country  population
0  London  England     8615246
1  Berlin  Germany     3562166
2  Madrid    Spain     3165235
3    Rome    Italy     2874038
4   Paris   France     2273305

# assign some other name to our columns or change in some other language

In [ ]:
city_frame.rename(columns={"name":"Nume", "country":"țară", "population":"populație"},
                 inplace=True)
city_frame

           țară  populație  cum_population
London  England    8615246         8615246
Berlin  Germany    3562166        12177412
Madrid    Spain    3165235        15342647
Rome      Italy    2874038        18216685
Paris    France    2273305        20489990

# Existing Column as the Index of a DataFrame
We want to create a more useful index in the following example. We will use the country name as the index, i.e. the list value associated to the key "country" of our cities dictionary:

In [ ]:
city_frame = pd.DataFrame(cities,
                          columns=["name", "population"],
                          index=cities["country"])
city_frame

           name  population
England  London     8615246
Germany  Berlin     3562166
Spain    Madrid     3165235
Italy      Rome     2874038
France    Paris     2273305

# set_index
#Alternatively, we can change an existing DataFrame. We can us the method set_index to turn a column into an index. "set_index" #does not work in-place, it returns a new data frame with the chosen column as the index:

In [ ]:
city_frame = pd.DataFrame(cities)
city_frame2 = city_frame.set_index("country")
print(city_frame2)

           name  population
country
England  London     8615246
Germany  Berlin     3562166
Spain    Madrid     3165235
Italy      Rome     2874038
France    Paris     2273305

In [ ]:
#We saw in the previous example that the set_index method returns a new DataFrame object and doesn't change the original DataFrame.
#If we set the optional parameter "inplace" to True, the DataFrame will be changed in place, i.e. no new object will be created:

city_frame = pd.DataFrame(cities)
city_frame.set_index("country", inplace=True)
print(city_frame)

           name  population
country
England  London     8615246
Germany  Berlin     3562166
Spain    Madrid     3165235
Italy      Rome     2874038
France    Paris     2273305

# Label-Indexing on the Rows
So far we have indexed DataFrames via the columns. 
We will demonstrate now, how we can access rows from DataFrames via the locators 'loc' and 'iloc'. 

iloc = 0 to n-1 ( pre-defined index )

loc = a,b,c....o ( User-defined/user-given index)

——-a). all elements MUST be unique

——b). MUST be of the same length as the data

In [ ]:
city_frame = pd.DataFrame(cities, 
                          columns=("name", "population"), 
                          index=cities["country"])
print(city_frame.loc["Germany"])

name           Berlin
population    3562166
Name: Germany, dtype: object

In [ ]:
print(city_frame.loc[["Germany", "France"]])

           name  population
Germany  Berlin     3562166
France    Paris     2273305

In [ ]:
print(city_frame.loc[city_frame.population>2000000])

           name  population
England  London     8615246
Germany  Berlin     3562166
Spain    Madrid     3165235
Italy      Rome     2874038
France    Paris     2273305

# Sum and Cumulative Sum
We can calculate the sum of all the columns of a DataFrame or the sum of certain columns:

In [ ]:
print(city_frame.sum())

name          LondonBerlinMadridRomeParis
population                       20489990
dtype: object

In [ ]:
city_frame["population"].sum()

20489990

In [ ]:
#We can use "cumsum" to calculate the cumulative sum:

x = city_frame["population"].cumsum()
print(x)

England     8615246
Germany    12177412
Spain      15342647
Italy      18216685
France     20489990
Name: population, dtype: int64

In [ ]:
#Assigning New Values to Columns
#x is a Pandas Series. We can reassign the previously calculated cumulative sums to the population column:

city_frame["population"] = x
print(city_frame)

           name  population
England  London     8615246
Germany  Berlin    12177412
Spain    Madrid    15342647
Italy      Rome    18216685
France    Paris    20489990

In [ ]:
#Instead of replacing the values of the population column with the cumulative sum, 
#we want to add the cumulative population sum as a new culumn with the name "cum_population".

city_frame = pd.DataFrame(cities,
                          columns=["country", 
                                   "population",
                                   "cum_population"],
                          index=cities["name"])
city_frame

        country  population cum_population
London  England     8615246            NaN
Berlin  Germany     3562166            NaN
Madrid    Spain     3165235            NaN
Rome      Italy     2874038            NaN
Paris    France     2273305            NaN

In [ ]:
#We will assign now the cumulative sums to this column:

city_frame["cum_population"] = city_frame["population"].cumsum()
city_frame

        country  population  cum_population
London  England     8615246         8615246
Berlin  Germany     3562166        12177412
Madrid    Spain     3165235        15342647
Rome      Italy     2874038        18216685
Paris    France     2273305        20489990

# Accessing the Columns of a DataFrame
There are two ways to access a column of a DataFrame. The result is in both cases a Series:

In [ ]:
print(city_frame["population"])

London       8615246
Berlin       3562166
Madrid       3165235
Rome         2874038
Paris        2273305
Vienna       1805681
Bucharest    1803425
Hamburg      1760433
Budapest     1754000
Warsaw       1740119
Barcelona    1602386
Munich       1493900
Milan        1350680
Name: population, dtype: int64

In [ ]:
# It will give an Serise 
print(city_frame.population)

London       8615246
Berlin       3562166
Madrid       3165235
Rome         2874038
Paris        2273305
Vienna       1805681
Bucharest    1803425
Hamburg      1760433
Budapest     1754000
Warsaw       1740119
Barcelona    1602386
Munich       1493900
Milan        1350680
Name: population, dtype: int64

In [ ]:
print(type(city_frame.population))

<class 'pandas.core.series.Series'>

# Assigning New Values to a Column
The column area is still not defined. We can set all elements of the column to the same value:

In [ ]:
city_frame["area"] = 1572
print(city_frame)

           country  population  cum_population  area
London     England     8615246         8615246  1572
Berlin     Germany     3562166        12177412  1572
Madrid       Spain     3165235        15342647  1572
Rome         Italy     2874038        18216685  1572
Paris       France     2273305        20489990  1572
Vienna     Austria     1805681        22295671  1572
Bucharest  Romania     1803425        24099096  1572
Hamburg    Germany     1760433        25859529  1572
Budapest   Hungary     1754000        27613529  1572
Warsaw      Poland     1740119        29353648  1572
Barcelona    Spain     1602386        30956034  1572
Munich     Germany     1493900        32449934  1572
Milan        Italy     1350680        33800614  1572

# Sorting DataFrames
Let's sort our DataFrame according to the city area:

In [ ]:
city_frame = city_frame.sort_values(by="area", ascending=False)
print(city_frame)

           country  population  cum_population  area
London     England     8615246         8615246  1572
Berlin     Germany     3562166        12177412  1572
Madrid       Spain     3165235        15342647  1572
Rome         Italy     2874038        18216685  1572
Paris       France     2273305        20489990  1572
Vienna     Austria     1805681        22295671  1572
Bucharest  Romania     1803425        24099096  1572
Hamburg    Germany     1760433        25859529  1572
Budapest   Hungary     1754000        27613529  1572
Warsaw      Poland     1740119        29353648  1572
Barcelona    Spain     1602386        30956034  1572
Munich     Germany     1493900        32449934  1572
Milan        Italy     1350680        33800614  1572

# Inserting a column at a specific location using insert 

Parameter	Meaning
loc	                int    This value should be within the range 0 <= loc <= len(columns)
column	            the column name
value	            can be a list, a Series an array or a scalar
allow_duplicates	If allow_duplicates is False, an Exception will be raised, if column is already contained in the DataFrame.

In [ ]:
#insert(self, loc, column, value, allow_duplicates=False)`
city_frame = pd.DataFrame(cities,
                          columns=["country", 
                                   "population"],
                          index=cities["name"])
area = [1572, 891.85, 605.77, 1285, 
        105.4, 414.6, 228, 755, 
        525.2, 517, 101.9, 310.4, 
        181.8]
idx = 1
city_frame.insert(loc=idx, column='area', value=area)
city_frame

           country     area  population
London     England  1572.00     8615246
Berlin     Germany   891.85     3562166
Madrid       Spain   605.77     3165235
Rome         Italy  1285.00     2874038
Paris       France   105.40     2273305
Vienna     Austria   414.60     1805681
Bucharest  Romania   228.00     1803425
Hamburg    Germany   755.00     1760433
Budapest   Hungary   525.20     1754000
Warsaw      Poland   517.00     1740119
Barcelona    Spain   101.90     1602386
Munich     Germany   310.40     1493900
Milan        Italy   181.80     1350680

# DataFrame from Nested Dictionaries
A nested dictionary of dicts can be passed to a DataFrame as well. The indices of the outer dictionary are taken as the the columns and the inner keys. i.e. the keys of the nested dictionaries, are used as the row indices:

In [ ]:
growth = {"Switzerland": {"2010": 3.0, "2011": 1.8, "2012": 1.1, "2013": 1.9},
          "Germany": {"2010": 4.1, "2011": 3.6, "2012":	0.4, "2013": 0.1},
          "France": {"2010":2.0,  "2011":2.1, "2012": 0.3, "2013": 0.3},
          "Greece": {"2010":-5.4, "2011":-8.9, "2012":-6.6, "2013":	-3.3},
          "Italy": {"2010":1.7, "2011":	0.6, "2012":-2.3, "2013":-1.9}
          } 
growth_frame = pd.DataFrame(growth)
growth_frame

      France  Germany  Greece  Italy  Switzerland
2010     2.0      4.1    -5.4    1.7          3.0
2011     2.1      3.6    -8.9    0.6          1.8
2012     0.3      0.4    -6.6   -2.3          1.1
2013     0.3      0.1    -3.3   -1.9          1.9

In [ ]:
# we can have the transpose of this as 
growth_frame.T

             2010  2011  2012  2013
France        2.0   2.1   0.3   0.3
Germany       4.1   3.6   0.4   0.1
Greece       -5.4  -8.9  -6.6  -3.3
Italy         1.7   0.6  -2.3  -1.9
Switzerland   3.0   1.8   1.1   1.9

# Reading and Writing Data
Digits as File Input and Output

All the powerful data structures like the Series and the DataFrames would avail to nothing, if the Pandas module wouldn't provide powerful functionalities for reading in and writing out data. It is not only a matter of having a functions for interacting with files. To be useful to data scientists it also needs functions which support the most important data formats like

Delimiter-separated files, like e.g. csv
Microsoft Excel files
HTML
XML
JSON

In [ ]:
import pandas as pd
exchange_rates = pd.read_csv("C:\\Users\PC\Desktop\dollar_euro.txt",
                             sep="\t")
print(exchange_rates)

FileNotFoundError: File b'C:\\Users\\PC\\Desktop\\dollar_euro.txt' does not exist

In [ ]:
# we can specify a name for each of the column
import pandas as pd
exchange_rates = pd.read_csv("C:\\Users\PC\Desktop\dollar_euro.txt",
                             sep="\t",
                             header=0,
                             names=["year", "min", "max", "days"])
print(exchange_rates)